<?php

$first_message_after_start = "Вітаю! Текст для привітання людини яка тільки почала використовувати бота, та пропозиція вибрати регіон.";


// кнопки вибору області
$btn_select_obl = json_encode([
    'inline_keyboard' => [
        [
            [
                "text" => "Черкаська",
                "callback_data" => "22"
            ],
            [
                "text" => "Чернігівська",
                "callback_data" => "24"
            ],
            [
                "text" => "Чернівецька",
                "callback_data" => "23"
            ]
        ],
        [

            [
                "text" => "Дніпропетровська",
                "callback_data" => "3"
            ],
            [
                "text" => "Донецька",
                "callback_data" => "4"
            ],
            [
                "text" => "Івано-Франківська",
                "callback_data" => "8"
            ]
        ],
        [

            [
                "text" => "Харківська",
                "callback_data" => "19"
            ],
            [
                "text" => "Херсонська",
                "callback_data" => "20"
            ],
            [
                "text" => "Хмельницька",
                "callback_data" => "21"
            ]
        ],
        [

            [
                "text" => "Київська",
                "callback_data" => "9"
            ],
            [
                "text" => "Кіровоградська",
                "callback_data" => "10"
            ],
            [
                "text" => "Луганська",
                "callback_data" => "11"
            ]
        ],
        [

            [
                "text" => "Львівська",
                "callback_data" => "12"
            ],
            [
                "text" => "Миколаївська",
                "callback_data" => "13"
            ],
            [
                "text" => "Одеська",
                "callback_data" => "14"
            ]
        ],
        [

            [
                "text" => "Полтавська",
                "callback_data" => "15"
            ],
            [
                "text" => "Рівненська",
                "callback_data" => "16"
            ],
            [
                "text" => "Сумська",
                "callback_data" => "17"
            ]
        ],
        [

            [
                "text" => "Тернопільська",
                "callback_data" => "18"
            ],
            [
                "text" => "Вінницька",
                "callback_data" => "1"
            ],
            [
                "text" => "Волинська",
                "callback_data" => "2"
            ]
        ],
        [

            [
                "text" => "Закарпатська",
                "callback_data" => "6"
            ],
            [
                "text" => "Запорізька",
                "callback_data" => "7"
            ],
            [
                "text" => "Житомирська",
                "callback_data" => "5"
            ]
        ]
    ],
], true);



$btn_regular = json_encode([
    "keyboard" => [
        [
            [
                "text" => "Змінити регіон для сповіщення",
                "callback_data" => "change_region"
            ],
            [
                "text" => "Відписатися від сповіщення",
                "callback_data" => "unsubscribe"
            ]
        ]
    ],

    'one_time_keyboard' => true,

    'resize_keyboard' => true,
], true);


/* $btn_unsubscribe = json_encode([
    "keyboard" => [
        [
            [
                "text" => "Відписатися від сповіщення",
                "callback_data" => "unsubscribe"
            ]
        ]
    ],

    'one_time_keyboard' => true,

    'resize_keyboard' => false,
], true); */


$selected_region = [
    '22' => 'черкаській',
    '24' => 'чернігівській',
    '23' => 'чернівецькій',
    '3' => 'дніпропетровській',
    '4' => 'донецькій',
    '8' => 'івано-франківській',
    '19' => 'харківській',
    '20' => 'херсонській',
    '21' => 'хмельницькій',
    '9' => 'київській',
    '10' => 'кіровоградській',
    '11' => 'луганській',
    '12' => 'львівській',
    '13' => 'миколаївській',
    '14' => 'одесьській',
    '15' => 'полтавській',
    '16' => 'рівненській',
    '17' => 'сумській',
    '17' => 'тернопільській',
    '1' => 'вінницькій',
    '2' => 'волинській',
    '6' => 'закарпатській',
    '7' => 'запорізькій',
    '5' => 'житомирській'
];



$done_msg = "Ви підписалися на сповіщення від боту при повітряній тривозі в $selected_region[$region] області. Мирного неба вам над головою!";

$change_region_msg = "Вас видалено зі списку на сповіщення. Якщо ви не хочете отримувати сповіщення, не вибирайте нічого. Якщо хочете отримувати сповіщення про повітряну тривогу в іншому регіоні, виберіть новий регіон:";

$unsubscribe = "Ви відписалися від сповіщень про повітряну тривогу. Якщо хочете підписатися знову - натисніть /start";

$alert_now_msg = "Увага! Зараз в $selected_region[$region] області приває тривога! Негайно в укриття!";

